#### Terraform Plan 📋

```
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.keyvault.data.azurerm_client_config.current: Reading...
module.keyvault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jYTBjMDAzMC03MTIwLTQzZDQtYWE5OC1kYTFhNDhmYzA0ZmE7b2JqZWN0SWQ9OTI4YzBiZTctMWVkYS00MjhmLThkYzItYTJhNDQzZTk1MTg4O3N1YnNjcmlwdGlvbklkPWE4ZGNiMzhjLTk5NDUtNDdlZi1hMTU3LTBjMTdmZDJmZmUwOTt0ZW5hbnRJZD01NjRkYWJhOS00OWYzLTQwMTgtYTdkOC0wYTgzMWM2Y2Y5YTE=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jYTBjMDAzMC03MTIwLTQzZDQtYWE5OC1kYTFhNDhmYzA0ZmE7b2JqZWN0SWQ9OTI4YzBiZTctMWVkYS00MjhmLThkYzItYTJhNDQzZTk1MTg4O3N1YnNjcmlwdGlvbklkPWE4ZGNiMzhjLTk5NDUtNDdlZi1hMTU3LTBjMTdmZDJmZmUwOTt0ZW5hbnRJZD01NjRkYWJhOS00OWYzLTQwMTgtYTdkOC0wYTgzMWM2Y2Y5YTE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "centralindia"
      + name     = "rg-finops-dev"
      + tags     = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.acr.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "centralindia"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-finops-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.container_apps.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "centralindia"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "finops-dev"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-finops-dev"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
      + zone_redundancy_enabled          = false
    }

  # module.container_apps.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralindia"
      + name                            = "finops-dev-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-finops-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
      + workspace_id                    = (known after apply)
    }

  # module.database.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = "finopsadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "centralindia"
      + name                          = "finops-dev-pg"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-finops-dev"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
      + version                       = "16"
      + zone                          = "1"
    }

  # module.database.azurerm_postgresql_flexible_server_database.this will be created
  + resource "azurerm_postgresql_flexible_server_database" "this" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "finops"
      + server_id = (known after apply)
    }

  # module.database.azurerm_postgresql_flexible_server_firewall_rule.allow_azure will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "allow_azure" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # module.keyvault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = [
          + {
              + object_id          = "928c0be7-1eda-428f-8dc2-a2a443e95188"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + tenant_id          = "564daba9-49f3-4018-a7d8-0a831c6cf9a1"
            },
        ]
      + enable_rbac_authorization     = false
      + id                            = (known after apply)
      + location                      = "centralindia"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-finops-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }
      + tenant_id                     = "564daba9-49f3-4018-a7d8-0a831c6cf9a1"
      + vault_uri                     = (known after apply)
    }

  # module.keyvault.azurerm_key_vault_secret.secrets["database-url"] will be created
  + resource "azurerm_key_vault_secret" "secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "database-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault.azurerm_key_vault_secret.secrets["jwt-secret"] will be created
  + resource "azurerm_key_vault_secret" "secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "jwt-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault.azurerm_key_vault_secret.secrets["llm-api-key"] will be created
  + resource "azurerm_key_vault_secret" "secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "llm-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault.azurerm_key_vault_secret.secrets["redis-url"] will be created
  + resource "azurerm_key_vault_secret" "secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "redis-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.redis.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "centralindia"
      + minimum_tls_version           = "1.2"
      + name                          = "finops-dev-redis"
      + non_ssl_port_enabled          = false
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-finops-dev"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "finops"
        }

      + redis_configuration {
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_admin_username  = (known after apply)
  + acr_login_server    = (known after apply)
  + keyvault_uri        = (known after apply)
  + postgres_fqdn       = (known after apply)
  + redis_hostname      = (known after apply)
  + resource_group_name = "rg-finops-dev"
Releasing state lock. This may take a few moments...

```

*Plan ran on: `3b6d3ea10530e7928c20c9a79056f41c614124ad`*